Revit 2024 API
Application.NewFamilySymbolProfile Method
Creates a new FamilySymbolProfile object.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public FamilySymbolProfile NewFamilySymbolProfile(
	FamilySymbol familySymbol
)
Visual Basic
Public Function NewFamilySymbolProfile ( _
	familySymbol As FamilySymbol _
) As FamilySymbolProfile
Visual C++
public:
FamilySymbolProfile^ NewFamilySymbolProfile(
	FamilySymbol^ familySymbol
)
Parameters
familySymbol
Type: Autodesk.Revit.DB.FamilySymbol
The family symbol of the Profile.
Return Value
The new FamilySymbolProfile object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  Thrown when the argument familySymbol is null.
See Also
Application Class
Autodesk.Revit.Creation Namespace